Com_Label = ['통고', '선발', '귀속', '확정', '제안서', '입력', '결심', '인계서', '위문',
             '의견', '지시', '식재', '송출', '이설', '발급', '제기', '검토', '비용', '매입',
             '선정', '말소', '회의록', '접수', '안내', '대리', '광고', '견학', '유류비', '분장',
             '독려', '예치', '보강', '간담회', '벤치마킹', '선납', '서작성', '환불', '파기', '철거',
             '대수', '회부', '승계', '시청', '처리', '방문', '이전', '임명', '조회서', '현황',
             '경정','공지', '제청', '이행', '확인서', '실시', '건의', '보고회', '의결', '자수',
             '근무', '대행', '유인', '도장', '매각', '대체', '여비', '집행', '전파', '수리',
             '출연', '부착', '개선', '열람', '필증', '교체', '권고', '봉축', '수수료', '의뢰',
             '답변', '촉탁', '계도', '조사', '개정', '해제', '고지', '승인', '불입', '연기',
             '업체', '등록', '합의서', '심사', '반납', '반려', '이관', '갱신', '현수막',
             '독촉', '고시', '오찬', '공개', '촉구', '정지', '표창', '서류', '공탁', '상환',
             '명기', '관측', '명령', '사유', '구입', '영수증', '신청', '추심', '복사', '계획',
             '검사비', '시공', '전배', '평가', '결정', '연납', '추천', '통지', '포기', '협약서',
             '수령', '워크숍', '추가', '매뉴얼', '공고문', '통보서', '공유', '적용', '대응',
             '활용', '급식', '최고', '정정', '랩핑', '선팅', '운동', '지출', '공달', '신청서',
             '수정', '청문', '배분', '소독', '알림', '배당금', '사업', '승락', '징수', '부존재',
             '조사서', '청소', '산정', '이입', '집계', '구성안', '인화', '조례안', '수렴', '당부',
             '보고서', '교정', '인정', '회신', '제거', '용역', '입찰', '연장', '해단식', '구독',
             '허가', '참가', '지도', '구축', '증설', '사역', '합의', '만찬', '심의서', '계약',
             '제본', '계획서', '도입', '의결서', '중지', '현행화', '방안', '시범', '출원', '취하',
             '썬팅', '정산서', '예고', '협찬', '건수', '회보', '관급자재', '협의', '개장', '복명서',
             '결산', '보조', '회수', '퇴직', '배분량', '발부', '일정', '적립', '세차', '보험', '기준',
             '참석', '취소', '업그레이드', '연계', '충전', '조치', '예산안', '전달', '발간', '결과서',
             '보관', '실습', '징구', '대장', '착공계', '요청', '감액', '보급', '해촉', '방역', '구매',
             '교체비', '처분', '공고', '출장', '프로그램', '안내문', '폐기', '선임', '임대', '식사',
             '제외', '진달', '편성안', '인수서', '연락', '해지', '환급', '공연', '환수', '보상',
             '결재', '채용', '인수', '결의', '분장안', '규정', '수당', '감면', '교환', '지정',
             '폐전', '위촉', '삭제', '청구서', '설정', '복명', '감시', '축사', '수립', '공사',
             '렌탈', '세입', '요구', '예산', '목록', '주입', '배정', '당직', '세척', '통지서',
             '해약', '시행', '정비', '관리', '가입', '수선', '조회', '사용', '예탁', '인출',
             '봉행', '편성', '회보서', '배제', '확인', '제정', '변경', '설명회', '파악', '검사',
             '수거', '출력', '회시', '고발', '교부', '설치', '인가', '제고', '면허', '통계서',
             '신고서', '공포', '요령', '전용', '강조', '공증', '유지', '통보', '촬영', '평정',
             '합산', '기각', '조정', '날짜', '정산', '민원', '위임', '인도', '자료', '준수',
             '규정안', '운영', '보수', '점검', '동의', '개설', '회람', '규칙안', '선고',
             '요청서', '책정', '게시', '대여', '구성', '전환', '건설', '접속', '모집', '신고',
             '추진', '실적', '지침', '배부', '부적합', '측정', '측량', '면접', '구입비', '교육',
             '감경', '전개', '발표', '문의', '이동', '배포', '홍보', '공시', '유예', '전출',
             '기록부', '부여', '프로젝트', '납부', '체결', '요구서', '청구', '철저', '행사',
             '조서', '폐쇄', '각하', '소통', '응모', '철회', '지원', '게재', '반환', '완료계',
             '협조', '초청','공모', '제정안', '기준표', '수매', '보완', '사항', '명단', '일지', '통계',
             '개정안', '제공', '상정', '정보', '보험료', '정리', '게첨', '시달', '작성', '진단',
             '송부', '수납', '대책', '문책', '순찰', '주의', '질의', '기안',
             '계획안', '공급', '단속', '제출', '납입', '강화', '참여', '청취',
             '수요', '교실', '송달', '승급', '보고', '약제', '이첩',
             '획정', '구제', '내시', '지급', '내역', '채취', '부과', '회식', '계고',
             '총회', '접종', '명령서', '개최', '수여', '계약서', '기부', '회의', '심의',
             '처리안', '발송', '트도색', '임차', '품의', '예시', '위탁', '송금',
             '답변서', '완료', '임대료', '여부', '반송', '조성', '서약', '제작',
             '업데이트', '명세서', '발령', '인쇄', '공표', '입금', '인계', '세탁', '강구', '여입',
             '교재', '이송', '자재', '작업', '위촉식', '결과', '협약', '도색', '격려']

Com_Label1 = {'대장': 'D', '배분량': 'D', '규정안': 'D', '임대료': 'D', '품의': 'D',
              '인수': 'D', '추천': 'D', '내시': 'D', '세입': 'D', '인정': 'D', '제본': 'D',
              '통지서': 'D', '접수': 'D', '발송': 'D', '사업': 'D', '합의서': 'D', '전달': 'D',
              '촬영': 'D', '징구': 'D', '기각': 'D', '명기': 'D', '초청': 'D', '기부': 'D',
              '참가': 'D', '계약서': 'D', '기안': 'D', '제거': 'D', '급식': 'D', '전개': 'D',
              '유예': 'D', '추심': 'D', '작업': 'D', '복명서': 'D', '경정': 'D', '배제': 'D',
              '출장': 'D', '고지': 'D', '통계서': 'D', '배분': 'D', '벤치마킹': 'D',
              '편성안': 'D', '동의': 'D', '승계': 'D', '삭제': 'D', '운영': 'D', '보고서': 'D',
              '회수': 'D', '퇴직': 'D', '교재': 'D', '보수': 'D', '사역': 'D', '철거': 'D',
              '신고': 'D', '필증': 'D', '수정': 'D', '청문': 'D', '제고': 'D', '선팅': 'D',
              '집계': 'D', '방안': 'D', '업그레이드': 'D', '채용': 'D', '처리': 'D', '조례안': 'D',
              '회신': 'D', '협의': 'D', '촉탁': 'D', '인도': 'D', '면접': 'D', '환급': 'D',
              '계도': 'D', '시범': 'D', '건수': 'D', '공탁': 'D', '정산': 'D', '서작성': 'D',
              '확정': 'D', '시청': 'D', '고발': 'D', '취소': 'D', '시달': 'D', '통보서': 'D',
              '입금': 'D', '트도색': 'D', '통계': 'D', '분장안': 'D', '청구': 'D', '서약': 'D',
              '유류비': 'D', '완료계': 'D', '현황': 'D', '인계서': 'D', '교육': 'D', '부존재': 'D',
              '요령': 'D', '규정': 'D', '산정': 'D', '연장': 'D', '해약': 'D', '설정': 'D',
              '게재': 'D', '충전': 'D', '증설': 'D', '인출': 'D', '공달': 'D', '확인': 'D',
              '대책': 'D', '배포': 'D', '인수서': 'D', '촉구': 'D', '지급': 'D', '공고': 'D',
              '의결': 'D', '매각': 'D', '부착': 'D', '답변': 'D', '명세서': 'D', '문책': 'D',
              '보험료': 'D', '발급': 'D', '이전': 'D', '조정': 'D', '인가': 'D', '평정': 'D',
              '회시': 'D', '청구서': 'D', '안내': 'D', '책정': 'D', '입찰': 'D', '측정': 'D',
              '착공계': 'D', '지침': 'D', '제외': 'D', '계고': 'D', '수령': 'D', '복명': 'D',
              '발간': 'D', '수거': 'D', '오찬': 'D', '렌탈': 'D', '말소': 'D', '집행': 'D',
              '준수': 'D', '의뢰': 'D', '측량': 'D', '조성': 'D', '견학': 'D', '협찬': 'D',
              '결의': 'D', '승인': 'D', '심의서': 'D', '교정': 'D', '여입': 'D', '반송': 'D',
              '제정안': 'D', '인계': 'D', '점검': 'D', '구입': 'D', '순찰': 'D', '위촉식': 'D',
              '임차': 'D', '감경': 'D', '폐쇄': 'D', '폐전': 'D', '합산': 'D', '질의': 'D',
              '워크숍': 'D', '수당': 'D', '실적': 'D', '위탁': 'D', '사유': 'D', '회보서': 'D',
              '복사': 'D', '회보': 'D', '알림': 'D', '업체': 'D', '격려': 'D', '도색': 'D',
              '보조': 'D', '이송': 'D', '접종': 'D', '세척': 'D', '보완': 'D', '결심': 'D',
              '자재': 'D', '소독': 'D', '감면': 'D', '해단식': 'D', '예시': 'D', '내역': 'D',
              '감액': 'D', '철회': 'D', '처리안': 'D', '진단': 'D', '의견': 'D', '배부': 'D',
              '심사': 'D', '방문': 'D', '접속': 'D', '조회': 'D', '위문': 'D', '대수': 'D',
              '매입': 'D', '예탁': 'D', '조치': 'D', '강조': 'D', '대리': 'D', '개최': 'D',
              '서류': 'D', '명단': 'D', '이행': 'D', '게첨': 'D', '여비': 'D', '발부': 'D',
              '선정': 'D', '매뉴얼': 'D', '제청': 'D', '유인': 'D', '징수': 'D', '표창': 'D',
              '개장': 'D', '고시': 'D', '해지': 'D', '행사': 'D', '파기': 'D', '공포': 'D',
              '구독': 'D', '날짜': 'D', '일지': 'D', '세차': 'D', '결과서': 'D', '관리': 'D',
              '결정': 'D', '독촉': 'D', '지출': 'D', '적용': 'D', '회의': 'D', '선임': 'D',
              '축사': 'D', '구입비': 'D', '문의': 'D', '전환': 'D', '당직': 'D', '수요': 'D',
              '공개': 'D', '이관': 'D', '임대': 'D', '공모': 'D', '검토': 'D', '구성': 'D',
              '방역': 'D', '발표': 'D', '일정': 'D', '이설': 'D', '보관': 'D', '영수증': 'D',
              '출력': 'D', '배당금': 'D', '해촉': 'D', '전파': 'D', '대응': 'D', '게시': 'D',
              '교체': 'D', '합의': 'D', '청소': 'D', '지시': 'D', '최고': 'D', '사용': 'D',
              '교부': 'D', '협약': 'D', '임명': 'D', '자수': 'D', '구매': 'D', '강구': 'D',
              '예고': 'D', '실습': 'D', '구성안': 'D', '추진': 'D', '통지': 'D', '지도': 'D',
              '취하': 'D', '결산': 'D', '획정': 'D', '등록': 'D', '승락': 'D', '송금': 'D',
              '현행화': 'D', '수렴': 'D', '완료': 'D', '도입': 'D', '개정안': 'D', '규칙안': 'D',
              '활용': 'D', '유지': 'D', '귀속': 'D', '공연': 'D', '철저': 'D', '광고': 'D',
              '목록': 'D', '보급': 'D', '참여': 'D', '교체비': 'D', '분장': 'D', '파악': 'D',
              '협조': 'D', '작성': 'D', '정산서': 'D', '권고': 'D', '출원': 'D', '연납': 'D',
              '식재': 'D', '응모': 'D', '요구서': 'D', '의결서': 'D', '연기': 'D', '요구': 'D',
              '회의록': 'D', '출연': 'D', '송달': 'D', '운동': 'D', '포기': 'D', '공시': 'D',
              '답변서': 'D', '회식': 'D', '정지': 'D', '통보': 'D', '예치': 'D', '제기': 'D',
              '송부': 'D', '기준표': 'D', '조서': 'D', '현수막': 'D', '평가': 'D', '이동': 'D',
              '승급': 'D', '홍보': 'D', '상환': 'D', '개설': 'D', '관측': 'D', '썬팅': 'D',
              '이입': 'D', '진달': 'D', '상정': 'D', '만찬': 'D', '회람': 'D', '사항': 'D',
              '소통': 'D', '봉축': 'D', '해제': 'D', '기준': 'D', '지정': 'D', '요청서': 'D',
              '청취': 'D', '시공': 'D', '부여': 'D', '조회서': 'D', '개선': 'D', '각하': 'D',
              '당부': 'D', '전출': 'D', '대체': 'D', '위임': 'D', '검사비': 'D', '확인서': 'D',
              '수납': 'D', '선납': 'D', '인화': 'D', '수수료': 'D', '전배': 'D', '갱신': 'D',
              '봉행': 'D', '단속': 'D', '회부': 'D', '공지': 'D', '연계': 'D', '공급': 'D',
              '제작': 'D', '근무': 'D', '열람': 'D', '프로그램': 'D', '비용': 'D', '송출': 'D',
              '랩핑': 'D', '체결': 'D', '강화': 'D', '수매': 'D', '안내문': 'D', '프로젝트': 'D',
              '예산안': 'D', '참석': 'D', '공고문': 'D', '선고': 'D', '모집': 'D', '관급자재': 'D',
              '세탁': 'D', '기록부': 'D', '추가': 'D', '면허': 'D', '도장': 'D', '식사': 'D',
              '반려': 'D', '공증': 'D', '업데이트': 'D', '협약서': 'D', '민원': 'D', '주의': 'D',
              '공유': 'D', '구제': 'D', '환불': 'D', '채취': 'D', '대행': 'D', '가입': 'D',
              '전용': 'D', '중지': 'D', '조사서': 'D', '환수': 'D', '교환': 'D', '이첩': 'D',
              '보고회': 'D', '정정': 'D', '총회': 'D', '보강': 'D', '간담회': 'D', '설명회': 'D',
              '제안서': 'D', '부과': 'D', '주입': 'D', '통고': 'D', '수선': 'D', '구축': 'D',
              '약제': 'D', '교실': 'D', '감시': 'D', '신고서': 'D', '선발': 'D', '부적합': 'D',
              '공표': 'D', '적립': 'D', '독려': 'D', '설치': 'D', '연락': 'D', '건설': 'D',
              '입력': 'D', '여부': 'D', '처분': 'D'}

Com_Label2=['지원', '제출', '폐기', '허가', '건의', '신청', '명령서', '예산', '조사',
            '보험', '제정', '수여', '결재', '자료', '시행', '배정', '납부', '공사', '검사',
            '결과', '계획', '명령', '보고', '수리', '요청', '정비', '신청서', '반환', '인쇄',
            '납입', '정리', '수립', '심의', '계획서', '반납', '불입', '계약', '개정', '보상',
            '정보', '편성', '발령', '변경', '용역', '위촉', '계획안', '제공', '대여', '실시']

Position = ["시장","부시장","군수","부군수","구청장","부구청장","국장","과장","실장",
            "팀장","자기결재","주무관","사무관","관리사","공무직","공중보건의사","면장",
            "부면장","읍장","부읍장","소장","의장"]

계획_실시 = ["일제정비","조사","점검","사업","국가","인구"]
계획_추진 = ["인구증대","법규","조사","점검","전수조사"]
보고_결과 = ["일제조사","전수조사","심의회","협의회","간담회","의회","입법"]
수립_계획 =["일제조사","정비","점검","예산"]
시행_공사 = ["보수","보강","급수","설치","철거"]

def sep_specific(data,word1,word2):
    if word1 == '계획' and word2 == '실시':
        for w in 계획_실시:
            if w in data:
                return 'A'
        return 'B'
    if word1 == '계획' and word2 == '정비':
        if "일제" in data or "자체" in data:
            return 'A'
        else:
            return 'B'
    if word1 == '계획' and word2 == '추진':
        for w in 계획_추진:
            if w in data:
                return 'A'
        if '사업' in data: return 'B'
        else: return 'C'
    if word1 == '납부' and (word2 == '보험료' or word2 =='추가'):
        if "4대" in data or "산재" in data:
            return 'C'
        else:
            return 'D'
    if word1 == '납부' and word2 == '부담금':
        if '기금' in data:return 'C'
        else:return 'D'
    if word1 == '보고' and  word2 == '결과':
        for w in 보고_결과:
            if w in data:
                return 'B'
        return 'C'
    if word1 == '보고' and (word2 == '제출' or word2 == '편성'):
        if '예산' in data:return 'B'
        else: return 'C'
    if word1 == '수립' and  word2 == '계획':
        for w in 수립_계획:
            if w in data:
                return 'B'
        return 'C'
    if word1 == '시행' and  word2 == '공사':
        for w in 시행_공사:
            if w in data:
                return 'A'
        return 'B'
    if word1 == '시행' and  word2 == '용역':
        if '청소' in data  or '경비' in data:
            return 'C'
        else:
            return 'B'
    if word1 == '시행' and  word2 == '위탁':
        if '관리' in data or '시스템' in data or '운영' in data:
            return 'C'
        else:
            return 'C'
    if word1 == '실시' and word2 == '조사':
        if '전수' in data or '일제' in data:
            return 'A'
        else:
            return 'B'
    if word1 == '요청' and word2 == '추가':
        if '예산' in data or '사업' in data or '계약' in data:
            return 'C'
        else:
            return 'D'
    if word1 == '용역' and word2 == '구축':
        if '영상' in data or '회선' in data :
            return 'C'
        else:
            return 'B'
    if word1 == '제출' and word2 == '결과':
        if '일제' in data or '전수' in data:
            return 'A'
        else:
            return 'B'
    if word1 == '제출' and word2 == '계획':
        if '일제' in data or '전수' in data or '예산' in data or '재정' in data or '점검' in data or '사업' in data:
            return 'A'
        elif '행사' in data or '휴가' in data or '훈련' in data:
            return 'C'
        else:
            return 'B'
    if word1 == '제출' and word2 == '변경':
        if '연락처' in data or '일정' in data:
            return 'D'
        else:
            return 'C'
    if word1 == '제출' and word2 == '보고':
        if '전수' in data or '일제' in data:
            return 'A'
        else:
            return 'B'
    if word1 == '제출' and (word2 == '소요' or word2 == '수요' or word2 == '신청' or word2 == '신청서' or word2 == '요구'):
        if '예산' in data:
            return 'B'
        else:
            return 'C'
    if word1 == '제출' and word2 == '실적':
        if '일제' in data or '전수' in data:
            return 'A'
        else:
            return 'B'
    if word1 == '제출' and (word2 == '조사' or word2 == '조사서'):
        if '전수' in data:
            return 'A'
        elif '자연피해' in data or '지역현안' in data :
            return 'B'
        else:
            return 'C'
    if word1 == '제출' and word2 == '자료':
        if '전수' in data or '일제' in data:
            return 'A'
        elif '예산' in data or '국회' in data or '의회' in data or '회의' in data:
            return 'B'
        else:
            return 'C'
    if word1 == '제출' and word2 == '현황':
        if '전수조사' in data or '일제점검' in data:
            return 'B'
        else:
            return 'C'

    if word1 == '신청' and word2 == '폐지':
        if '국유' in data:
            return 'C'
        else:
            return 'D'